{
  "title": "Who This Is For",
  "subtitle": "Healing from trauma isn't linear.<br />See if you recognise yourself here.",
  "slides": [
    {
      "id": "survivor",
      "title": "The Survivor",
      "image": "slider-1.png",
      "imageAlt": "Soft morning light through a window",
      "content": "If this sounds familiar... You've done the hard work of surviving. Maybe you've had therapy, read the books, tried the things. But something still feels stuck. You know the language of healing, but the felt sense of it remains just out of reach. Your body still holds what your mind has processed. If you're ready to shift from getting through life to living it, you belong here."
    },
    {
      "id": "beginner",
      "title": "The Beginner",
      "image": "slider-2.png",
      "imageAlt": "A quiet journal and cup of tea, suggesting the beginning of something",
      "content": "Or maybe... You're just starting to connect the dots. Something in your past is affecting your present, but you're not quite sure what or how. The pieces are beginning to surface, and you need somewhere gentle to begin. A place that meets you exactly where you are, without needing you to have it all figured out first. You don't need a perfect trauma narrative to deserve support."
    },
    {
      "id": "cycle-breaker",
      "title": "The Cycle-Breaker",
      "image": "slider-3.png",
      "imageAlt": "A path through trees, clearly walked but not overgrown",
      "content": "Perhaps you've noticed... The same patterns keep showing up. You react in ways that don't match the situation. Your nervous system fires alarms when you're actually safe. You're working to break cycles, whether from your family, your past, or patterns you developed just to survive. You need tools that go deeper than 'think positive' and 'let it go.' You're ready to rewire, not just cope."
    },
    {
      "id": "invisible-wound",
      "title": "The Invisible Wound",
      "image": "slider-4.png",
      "imageAlt": "Water surface with light filtering through",
      "content": "Maybe your story is... There are no visible scars. Nothing 'bad enough' to count, or so you've been told. But you lived through something that left marks on your nervous system, your self-trust, your sense of safety in the world. What happened to you was real, even if others couldn't see it. You don't need to justify your pain to deserve healing."
    },
    {
      "id": "rebuilder",
      "title": "The Rebuilder",
      "image": "slider-5.png",
      "imageAlt": "Hands gently holding seeds or small plant",
      "content": "You might be... Finally stable but not quite *you* yet. The crisis has passed but you're left wondering who you are underneath all the survival strategies. You're safe now, but your body doesn't quite believe it. You want to trust yourself again, to feel at home in your own life. You're ready to move from 'not broken' to actually whole."
    },
    {
      "id": "uncertain",
      "title": "The Uncertain",
      "image": "slider-6.png",
      "imageAlt": "Space for uncertainty and questions",
      "content": "Perhaps the truth is... You're not sure where you fit. And here's the thing: knowing yourself isn't about finding the right box to climb into. Sometimes the most powerful knowing comes from recognising what you're not. What doesn't fit. What never did. You don't have to be everything, but you can be anything you want to be. You're welcome here without needing the perfect words or the right story. Questions, uncertainty, and all the space in between. Sometimes healing starts with 'I don't know who I am yet, but I'm learning what I'm not,' and that's exactly enough."
    }
  ]
}
